/*
 ============================================================================
 Name        : LocalizedStringTool.m
 Version     : 1.0.0
 Copyright   : 
 Description : 多语言工具类
 ============================================================================
 */

#import "LocalizedStringTool.h"

/***********************************************************************
 * 方法名称： L
 * 功能描述： 获取多语言key对应的值
 * 输入参数： key 名称
 * 输出参数：
 * 返回值：   多语言key对应的值
 ***********************************************************************/
NSString *L(NSString *key)
{
	return NSLocalizedString(key, nil);
}

/***********************************************************************
 * 方法名称： LT
 * 功能描述： 获取多语言key对应的值
 * 输入参数： key 名称
            table string文件名称
 * 输出参数：
 * 返回值：   多语言key对应的值
 ***********************************************************************/
NSString *LT(NSString *key, NSString *table)
{
	return NSLocalizedStringFromTable(key, table, nil);
}
