/*
 ============================================================================
 Name        : UIUtil.h
 Version     : 1.0.0
 Copyright   : 
 Description : 工具类
 ============================================================================
 */

#import <UIKit/UIKit.h>
#import "Header.h"
#import "AppData.h"
@interface UIUtil : NSObject

/***********************************************************************
 * 方法名称： showWarning
 * 功能描述： 弹出警告对话框
 * 输入参数： message 内容
            title 标题
            delegate 回调代理
 * 输出参数：
 * 返回值：  UIAlertView 对象
 ***********************************************************************/
//+ (UIAlertView *)showWarning:(NSString *)message title:(NSString *)title delegate:(id)delegate;

/***********************************************************************
 * 方法名称： showQuestion
 * 功能描述： 弹出问题对话框
 * 输入参数： message 内容
            title 标题
            delegate 回调代理
 * 输出参数：
 * 返回值：  UIAlertView 对象
 ***********************************************************************/
+ (UIAlertView *)showQuestion:(NSString *)message title:(NSString *)title delegate:(id)delegate;

/***********************************************************************
 * 方法名称： showToast
 * 功能描述： 弹出toast
 * 输入参数： text 内容
            inView 现在在哪个view
 * 输出参数：
 * 返回值：
 ***********************************************************************/
+ (void)showToast:(NSString *)text inView:(UIView *)view;

/***********************************************************************
 * 方法名称： showLocalNotification
 * 功能描述： 弹出本地通知
 * 输入参数： text 内容
 * 输出参数：
 * 返回值：
 ***********************************************************************/
+ (void)showLocalNotification:(NSString *)text;

/***********************************************************************
 * 方法名称： showProgressHUD
 * 功能描述： 弹出等待框
 * 输入参数： text 内容
            inView 现在在哪个view
 * 输出参数：
 * 返回值：
 ***********************************************************************/
+ (void)showProgressHUD:(NSString *)text inView:(UIView *)view;

/***********************************************************************
 * 方法名称： hideProgressHUD
 * 功能描述： 隐藏等待框
 * 输入参数：
 * 输出参数：
 * 返回值：
 ***********************************************************************/
+ (void)hideProgressHUD;

@end
